In [1]:
import numpy as np
import pandas as pd

In [3]:
dfp=pd.read_csv('jk10s/poblacion.csv')

In [4]:
dfp

                       Country  year           pop
0                  Afghanistan  2015  3.441360e+07
1                      Albania  2015  2.880703e+06
2                      Algeria  2015  3.972802e+07
3               American Samoa  2015  5.581200e+04
4                      Andorra  2015  7.801100e+04
...                        ...   ...           ...
1035  Pre-demographic dividend  2018  9.194854e+08
1036              Small states  2018  4.057532e+07
1037                South Asia  2018  1.814389e+09
1038   South Asia (IDA & IBRD)  2018  1.814389e+09
1039        Sub-Saharan Africa  2018  1.078307e+09

[1040 rows x 3 columns]

In [6]:
pd.options.display.float_format='{:,.1f}'.format

In [7]:
dfp

                       Country  year             pop
0                  Afghanistan  2015    34,413,603.0
1                      Albania  2015     2,880,703.0
2                      Algeria  2015    39,728,025.0
3               American Samoa  2015        55,812.0
4                      Andorra  2015        78,011.0
...                        ...   ...             ...
1035  Pre-demographic dividend  2018   919,485,393.0
1036              Small states  2018    40,575,321.0
1037                South Asia  2018 1,814,388,744.0
1038   South Asia (IDA & IBRD)  2018 1,814,388,744.0
1039        Sub-Saharan Africa  2018 1,078,306,520.0

[1040 rows x 3 columns]

In [9]:
dfp.dtypes

Country     object
year         int64
pop        float64
dtype: object

In [11]:
dfp['year'] =  pd.Categorical(dfp['year'].apply(str))

In [13]:
dfp.dtypes

Country      object
year       category
pop         float64
dtype: object

In [23]:
df_filtro=dfp['Country'].isin(['Aruba','Colombia'])
df_filtro.head(20)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
Name: Country, dtype: bool

In [21]:
df_sample=dfp[df_filtro]
df_sample

      Country  year          pop
9       Aruba  2015    104,341.0
42   Colombia  2015 47,520,667.0
269     Aruba  2016    104,872.0
302  Colombia  2016 48,171,392.0
529     Aruba  2017    105,366.0
562  Colombia  2017 48,901,066.0
789     Aruba  2018    105,845.0
822  Colombia  2018 49,648,685.0

In [25]:
list(df_sample)

['Country', 'year', 'pop']

In [26]:
df_sample.set_index(['Country','year'])

                       pop
Country  year
Aruba    2015    104,341.0
Colombia 2015 47,520,667.0
Aruba    2016    104,872.0
Colombia 2016 48,171,392.0
Aruba    2017    105,366.0
Colombia 2017 48,901,066.0
Aruba    2018    105,845.0
Colombia 2018 49,648,685.0

In [27]:
df_sample = df_sample.set_index(['Country','year']).sort_index()

In [28]:
df_sample

                       pop
Country  year
Aruba    2015    104,341.0
         2016    104,872.0
         2017    105,366.0
         2018    105,845.0
Colombia 2015 47,520,667.0
         2016 48,171,392.0
         2017 48,901,066.0
         2018 49,648,685.0

In [33]:
k=df_sample.loc['Colombia',:]
k

              pop
year
2015 47,520,667.0
2016 48,171,392.0
2017 48,901,066.0
2018 49,648,685.0

In [36]:
df_sample.xs(['Aruba','2018'])

/tmp/ipykernel_10862/2426754960.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df_sample.xs(['Aruba','2018'])

pop   105,845.0
Name: (Aruba, 2018), dtype: float64

In [38]:
df_sample.xs('2018',level='year')

                  pop
Country
Aruba       105,845.0
Colombia 49,648,685.0

In [39]:
df_countries= dfp.set_index(['Country','year']).sort_index()

In [40]:
df_countries

                          pop
Country     year
Afghanistan 2015 34,413,603.0
            2016 35,383,128.0
            2017 36,296,400.0
            2018 37,172,386.0
Albania     2015  2,880,703.0
...                       ...
Zambia      2018 17,351,822.0
Zimbabwe    2015 13,814,629.0
            2016 14,030,390.0
            2017 14,236,745.0
            2018 14,439,018.0

[1040 rows x 1 columns]

In [46]:
ids=pd.IndexSlice